{
    "nationality": "The country you legally belong to or are currently a citizen of.",
    "immigrant visa": "A physical visa stamp in a traveler's passport, allowing them to enter the U.S. to live permanently. Once an individual recives an Immigrant visa they will shortly recive a Permanent Resident Card (Green Card).",
    "permanent resident card": "Commonly refferd to as a 'Green Card', the Permanent Resident Card signifies lawful permanent resident status. Granting most of the rights of a citizen, such as working anywhere in the U.S. and petitioning for certain family members, but without the right to vote in federal elections.",
    "nonimmigrant visa": "A physical visa stamp in a traveler's passport, allowing foreign nationals to enter the United States for a specific, temporary purpose, such as tourism, business, study, or temporary work.",
    "public secondary school": "A free to attend school, publicly funded and operated by the government that enrolls students in grades nine through twelve.",
    "practical training": "Temporary, off-campus employment directly related to the student's field of study.",
    "visa category": "A specific classification that defines the purpose of a foreign national's temporary or permanent travel to the United States.",
    "two-year home country physical presence requirement": "If your J-1 exchange program was funded by the U.S government or your home government, or you received graduate medical education/training. You are required to return to your home country for 2 years after your program ends before you can apply to switch your visa category.",
    "A": "Visa for diplomats, government officials, and their employees.",
    "G": "Visa for individuals representing or working for an international organization, a foreign government at an international organization, and thier employees.",
    "T": "Visa for victims of severe forms of human trafficking who cooperate with law enforcement in the detection, investigation, or prosecution of such crimes.",
    "U": "Visa for victims of mental or physical abuse who cooperate with law enforcement in the detection, investigation, or prosecution of such crimes.",
    "lawful permanent resident": "A non-U.S. citizen who has been granted the right to live and work in the U.S. indefinitely. This includes people with immigrant visas and permanent resident cards.",
    "J-1 exchange visitor program": "A U.S. Department of State administered program that allows foreign nationals to participate in temporary educational and cultural exchanges in the U.S, such as for studying, teaching, or conducting research.",
    "student and exchange visitor program": "A U.S. Department of Homeland Security program that ensures the institutions accepting nonimmigrant students are certified and follow the federal rules and regulations that govern them.",
    "personal employee": "A worker who travels with an employer to the U.S. temporarily to provide household or personal services. This can include nannies, housekeepers, cooks, drivers, or paid companions.",
    "designated international organization": "An international organization that has been approved by the U.S. Department of State"
}